# Напишите функцию, которая принимает натуральное число и выводит его
# последнюю цифру

def getindex_(i):
    y = str(i)
    print(str(y[-1]))

getindex_(567)